import { create } from 'zustand'
import { toast } from 'react-toastify'

import api from '@/lib/api'

interface FormStore {
  data: any
  setData: (data: any) => void
  generateDocument: () => Promise<void>
}

export const useFormStore = create<FormStore>((setState, getState) => ({
  data: {
    region: 'بطنجة',
    compagnie: 'طنجة',
    centre: 'القضائي بطنجة',
    numero_pv: 12345,
    date_pv: new Date(),
    nom_personne_impliquee: 'مراد الصروخ',
    nom_officier_premier: 'عبدالرحيم أوموي',
    grade_officier_premier: 'رقيب أول',
    statut_officier_premier: '(ض.ش.ق)',
    nom_officier_deuxieme: 'خالد بوماي',
    grade_officier_deuxieme: 'رقيب',
    statut_officier_deuxieme: '(ع.ش.ق)',
    accusation_date: 'عاشر يونيو سنة ألفين وسبعة عشر ميلادية',
    accusation: 'محاولة الهجرة غير المشروع',
    article_code: '20 إلى 26 و 78',
    article_loi: 'المسطرة الجنائية',

    introduction:
      '    في يوم عاشر يونيو ألفين و سبعة عشر ميلادية على الساعة التاسعة صباحا، بمكتب مركزنا، أخبرنا هاتفيا من طرف قائد قيادة القصر الصغير بأن مجموعة من الأشخاص يرغبون في الهجرة غير المشروعة إلى أوروبا، و يتواجدون  بإحدى الضيعات الفلاحية بدوار عين الشوكة جماعة و قيادة القصر الصغير عمالة فحص أنجرة.\n' +
      '    إثر توصلنا بهذه المعلومات، أخبرنا هاتفيا قائد سريتنا و اتصلنا بالسيد وكيل الملك لدى المحكمة الإبتدائية بطنجة، الذي أمرنا بالتوجه إلى عين المكان.\n' +
      'انتقلنا فورا رفقة مجموعة من الدركيين على مثن سيارة المصلحة. و عند وصولنا  على الساعة التاسعة و النصف صباحا إلى ضيعة المسمى محمد لحربيلي الكائنة  بالدوار المذكور أعلاه المتواجدة على بعد 25 كلم جنوب مدينة طنجة و بالضبط بمحاذاة الشاطئ، لاحظنا أن هذه الضيعة محاطة بسياج، بها مرأب لإصلاح الألات الفلاحية و إسطبل. وقمنا بمحاصرتها.\n' +
      '     بعد اتخاذ كل الإجراءات اللازمة، داهمنا الضيعة فوجدنا بداخل الإسطبل ثلاثة أشخاص بالغين من بينهم امرأة، تبين من خلال تحرياتنا أنهم كانوا يستعدون لمغادرة التراب الوطني سرّا عبر البحر في اتجاه أوروبا دون التوفرعلى أية وثيقة قانونية. أثناء تفتيشنا للأماكن المجاورة، عثرنا على قارب مطاطي من نوع " زودياك" ذو محرك من نوع "ياماها" قوته الجبائية خمسون حصاناً و كمية هامة من البنزين تقدر بحوالي 200 لتر، حجزناها و سقنا هؤلاء الأشخاص إلى المركز قصد البحث معهم في النازلة.\n' +
      '    عند عودتنا إلى المركز في نفس اليوم على الساعة الحادية عشر و النصف صباحا، ربطنا الاتصال هاتفياً بالسيد وكيل الملك لدى لدى المحكمة الابتدائية بطنجة، حيث أطلعناه عن فحوى النازلة، فأصدر تعليماته بالاستماع إلى المعنيين بالأمر و إنجاز المسطرة على شكل معلومات قضائية، مع تعميق البحث للوصول إلى أفراد الشبكة و موافاته بكل مستجدّ في الموضوع.\n' +
      'تنفيذا لهذه التعليمات، أحضرنا أمامنا المعنيين بالأمر، حيث استمعنا إليهم في الموضوع على انفراد كما يلي:',

    personnes: [
      {
        identite: 'مرشح(ة)',
        nom: 'علي التازي',
        sexe: 'رجل',
        nom_pere: 'بن محمد بن علي',
        nationalite: 'مغربي',
        carte_nationale: 'CL40258',
        casier_judiciaire: 'بدون سوابق عدلية',
        ville_naissance: 'أصيلا',
        ville_actuelle: ' بها شارع غرناطة زنقة التوتة رقم 12',
        date_naissance: '1975-03-25T00:00:00.000Z',
        profession: 'مياوم',
        situation_familiale: 'متزوج(ة)',
        enfants: 'لطفلين',
        nom_mere: 'رحيمو بنت حميدو',
        declaration:
          'ازددت و نشأت بمدينة أصيلة، و درست بها حتى مستوى الخامس ابتدائي. \nو نظرا لوضعية عائلتي المزرية مادياً، انقطعت عن الدراسة، فأصبحت أشتغل كمياوم في مختلف الأعمال مقابل مدخول لا يكفي لسد حاجيات أسرتي، الشيء الذي أجبرني على التفكير في الهجرة غير المشروعة إلى أوروبا بُغية تحسين وضعيتي الاجتماعية.\nو من أجل هذه الغاية، تعرّفت على شخص يدعى "الزريقي" بإحدى المقاهي العمومية بمدينة طنجة. و بعد أن تجادبنا أطراف الحديث، اقترح عليّ هذا الأخير مساعدتي على الهجرة سراً على مثن قارب مطاطي إلى جنوب إسبانيا رفقة أشخاص آخرين مقابل مبلغ مالي قدره 7.000 درهما، و بعد استحساني للفكرة \nو موافقتي عليها، ضرب لي موعدا يوم 09 يونيو 2017 على الساعة 08 ليلا في نفس المقهى من أجل تسليمه النقود. إثر ذلك نقلني على متن سيارته  إلى المكان الذي تمت فيه محاصرتنا من طرفكم.\n- ب.م: إن السبب الذي دفعني للهجرة السرية إلى الضفة الأخرى هو تحسين\n         وضعيتي الاجتماعية.\n- ب.م : مستواي الدراسي هو الخامس ابتدائي.\n- ب.م : لم أحصل على أية شهادة أو دبلوم.\n- ب.م : لا أزاول أية مهنة.\n- ب.م :  لم يسبق لي أن قمت بمحاولة للهجرة غير المشروعة.\n- ب.م : لم يتوسط لي أي شخص في هذه العملية و لا أعرف أي شخص آخر يتعاطى لهذا النشاط.\n- ب.م : دفعت مبلغ 7.000 درهما للمدعو" الزريقي " مقابل هده العملية.\n- ب.م : صادفته بمقهى الورود بمدينة طنجة .\n- ب.م : تم نقلني إلى ضيعته الفلاحية بدوارعين الشوكة جماعة وقيادة القصر الصغيرعلى متن سيارته من نوع "رونو 19" سوداء اللون.\n- ب.م : أجهل ترقيم صفيحة تسجيل سيارته.\n- ب.م : أخبرني أن تهجيري سيتم على مثن زورق مطاطي أسود اللون.\n- ب.م : لم نقم بعد بأية محاولة للإبحار في اتجاه إسبانيا.\n- ب.م : لا أعرف النقطة التي كنا سنبحُر منها و لا المسار الذي كان المنظم المدعو "الزريقي" ينوي اتباعه للوصول إلى الجهة المقصودة.\n- ب.م : لا أحمل معي أية عملة صعبة.\n- ب.م : لا أعرف أي منظم آخر.\n- ب.م : كنت أرغب في الهجرة الى الديار الإسبانية.\n- ب.م : لا أعرف أي شخص في الضفة الأخرى.\n- ب.م : لم تكن هناك وعود قصد الحصول على عمل فور وصولي إلى إسبانيا.\n- ب.م : ليس لي أي فرد قريب سبق له القيام بالهجرة السرية.\n- ب.م : لا أتوفر إلا على البطاقة الوطنية للتعريف الإلكتروني.\n- ب.م : لم أُخبر أي فرد من عائلتي برغبتي في الهجرة سراً إلى إسبانيا.\n- ب.م : قمت ببيع دراجتي النارية من أجل توفير المبلغ الكافي للهجرة.\n- ب.م : هذا ما لدي من تصريح.\n في نفس اليوم و المكان على الساعة التانية عشر و خمسة و أربعون دقيقة زوالا، المعني بالأمر يعرف القراءة و الكتابة، تصريحه تلاه بنفسه، وافق عليه  دون زيادة أو حذف أونقصان أو تغيير، أصر، و وقع  و أبصم في دفتر التصريحات.'
      },
      {
        identite: 'مرشح(ة)',
        nom: 'سعيد الوافي',
        sexe: 'رجل',
        nom_pere: 'إدريس الوافي',
        nationalite: 'مغربي',
        carte_nationale: 'AB12345',
        casier_judiciaire: 'بدون سوابق عدلية',
        ville_naissance: 'الدار البيضاء',
        ville_actuelle: 'حي المسيرة رقم 17',
        date_naissance: '1982-07-15T00:00:00.000Z',
        profession: 'حرفي',
        situation_familiale: 'عازب(ة)',
        enfants: 'بدون',
        nom_mere: 'فاطمة بنت موسى',
        declaration: `لقد تعرضت لعملية نصب من طرف شخص وعدني بالعمل في أوروبا مقابل دفع مبلغ مالي. بدأت القصة حين تعرفت على شخص يدعى "أمين" عبر أحد مواقع التواصل الاجتماعي، حيث أكد لي أنه يمكنه تأمين عقد عمل في إسبانيا مقابل 15,000 درهم. بعد عدة محادثات وثقت به وقمت بتحويل المبلغ إلى حسابه البنكي.
        في اليوم المحدد لمغادرتي، طلب مني اللقاء في مدينة طنجة لاستكمال الإجراءات، لكن عند وصولي للمكان المتفق عليه، لم أجده هناك، وأصبح هاتفه غير متاح. انتظرت ساعات طويلة على أمل التواصل معه، ولكن دون جدوى. أدركت حينها أنني تعرضت لعملية احتيال.
        - ب.م: لم ألتقِ بالشخص الذي وعدني بالعقد بشكل مباشر، وكل التواصل كان عبر الإنترنت.
        - ب.م: حصلت على رقم هاتفه وحسابه البنكي من خلال محادثات واتساب.
        - ب.م: قمت بتحويل المبلغ على دفعتين إلى حساب بنكي باسم "أمين العلوي".
        - ب.م: لم أوقع على أي وثيقة رسمية أو عقد يثبت الاتفاق بيننا.
        - ب.م: لم أبلغ الشرطة فوراً بسبب خوفي من العواقب.
        - ب.م: أطلب التحقيق في الأمر لاسترجاع أموالي ومعاقبة المحتال.
        هذا ما لدي من تصريح، وقد وافقت عليه دون زيادة أو نقصان، وأقر بصحته وأوقع عليه.`
      },
      {
        identite: 'مرشح(ة)',
        nom: 'خالد بلمقدم',
        sexe: 'رجل',
        nom_pere: 'عبد الله بلمقدم',
        nationalite: 'مغربي',
        carte_nationale: 'DZ67890',
        casier_judiciaire: 'لديه سوابق عدلية',
        ville_naissance: 'طنجة',
        ville_actuelle: 'طنجة',
        date_naissance: '1990-11-02T00:00:00.000Z',
        profession: 'سائق شاحنة',
        situation_familiale: 'متزوج(ة)',
        enfants: '3 أطفال',
        nom_mere: 'حليمة بنت يوسف',
        declaration: `تم القبض علي أثناء محاولتي تهريب بعض الأشخاص إلى الضفة الأخرى من البحر الأبيض المتوسط. كنت على اتصال مع شخص يُدعى "الزريقي"، الذي اقترح علي المشاركة في هذه العملية مقابل 10,000 درهم عن كل شخص يتم تهريبه.
        يوم العملية، قمت بتجميع المجموعة في مزرعة بضواحي القصر الصغير، حيث تم تجهيز القارب المطاطي لنقلهم. عند اقترابنا من نقطة الانطلاق، فوجئنا بقدوم رجال الأمن الذين قاموا بتطويق المكان وإلقاء القبض علينا.
        - ب.م: لم أكن العقل المدبر للعملية، بل كنت مكلفاً بنقل الأشخاص إلى نقطة الانطلاق.
        - ب.م: لم أكن أحمل أي أسلحة أو مواد غير قانونية.
        - ب.م: كنت أعلم أن الأمر غير قانوني، ولكنني كنت بحاجة إلى المال.
        - ب.م: الشخص الذي نظم العملية يُدعى "الزريقي" وهو المسؤول عن تأمين القارب.
        - ب.م: لا أعرف تفاصيل عن المسار الذي كان من المقرر أن نسلكه نحو إسبانيا.
        - ب.م: لم أقم بأي محاولة سابقة لتنظيم عمليات تهريب مشابهة.
        هذا ما لدي من تصريح، وقد قرأته ووافقت عليه دون أي تغيير، وأصر وأوقع وأبصم في دفتر التصريحات.`
      }
    ],

    signaux:
      '  - تم تنقيط المعنيين بالأمر فلم يكونوا موضوع أي بحث .\n' +
      '  - حررنا برقية بحث في حق المسمى محمد الحربيلي المدعو "الزريقي" تحت رقم 1523/2 بتاريخ 10-06-2017 و بُعث بها إلى مصنف البطائق الجهوي للدرك الملكي بطنجة.\n' +
      '       - أخبرنا قائد سريتنا بواسطة البرقية عدد 1520/2 بتاريخ 10-06-2017.\n' +
      '  - إن القارب المطاطي من نوع "زودياك" و محركه من نوع "ياماها" و كذا كمية البنزين المقدرة ب 200 لتر، ستسلم إلى السيد رئيس مصلحة كتابة الضبط لدى المحكمة الإبتدائية بطنجة مقابل اعتراف.\n' +
      '- قمنا بفتح ملف الأبحاث الخاصة رقم 32/2017.',
    contrepartie_premier: 'إلى السيد وكيل الملك لدى المحكمة الإبتدائية بطنجة',
    contrepartie_deuxieme: 'للمحفوظـات',
    date_modifier_sceller: '10 يونيو 2017'
  },

  setData: (data: any) => setState({ data: { ...getState().data, ...data } }),

  generateDocument: async () => {
    try {
      const { data } = getState()

      console.log('data: ', data)

      // const response = await axios.post('/api/generate-pdf', data, { responseType: 'blob' })
      const response = await api.post('/generate-pdf', data, { responseType: 'blob' })

      const url = window.URL.createObjectURL(response.data)
      const link = document.createElement('a')

      // link.download = 'doc.pdf'
      link.href = url
      link.target = '_blank'
      document.body.appendChild(link)
      link.click()
      document.body.removeChild(link)
      window.URL.revokeObjectURL(url)
    } catch (error: any) {
      toast.error(error.message)
    }
  }
}))
